{
    "template": "cv.jade",
    "education": [
        {
            "school": "University of the Philippines - Diliman",
            "years": "2005 - 2010",
            "course": "BS Computer Science"
        }
    ],
    "jobs": [
        {
            "title": "SEPT 2016 - PRESENT Senior Software Developer, Kelly Services / CA-CIB",
            "description": "Developing compliance-related applications using AngularJS and C#. Performs technical design and code reviews along with enhancements and bug fixes.",
            "projects": [
                {
                    "description": "Implementing workflow applications using Angular with a C#.NET MVC backend."
                }
            ]
        }, 
        {
            "title": "JULY 2012 - AUGUST 2016 Software Developer, Willis Towers Watson",
            "description": "Worked on various HR applications using C#.NET, involved with design and code reviews while also providing support across different teams. Became the Learning module owner and lead engineer.",
            "projects": [
                {
                    "description": "Applied enhancements and bug fixes to a legacy HR application used for performance reviews and learning management. C#.NET MVC with ASP.NET web forms and jQuery / Javascript."
                },
                {
                    "description": "Converted a legacy application used for analyzing compensation survey data using vanilla Javascript and ADO.NET to Typescript / AngularJS with C#.NET and EF."
                },
                {
                    "description": "Created a contract management application that allows HR personnel to convert Word documents into templates and then create contracts from these templates."
                }
            ]
        }, 
        {
            "title": "MAY 2010 - JUNE 2012 Graduate Program Associate, Macquarie Offshore Services",
            "description": "Started as a database administrator, then specialized in security operations in Windows. Kickstarted development career by understanding the testing processes, creating both manual and automated test cases and then worked on enhancements, bug fixes, and automation solutions using Javascript and VB.NET.",
            "projects": [
                {
                    "description": "Provided support across different regions by handling database requests (SQL, Oracle, and Sybase) and access requests (Active Directory, Microsoft Exchange, and Vasco), maintenance, and performance improvements."
                },
                {
                    "description": "Created an operations assignment tool using VB.Net and Oracle to help the service operations team to efficiently apply workforce management."
                }
            ]
        }, 
        {
            "title": "APRIL 2009 - JUNE 2009 Intern, Seer Technologies",
            "description": "Created an accounting web application using Java.",
            "projects":[
                
            ]
        }
    ],
    "skills":[
        {
            "name": "C#.Net",
            "rating": 3
        },
        {
            "name": "SQL",
            "rating": 3
        },
        {
            "name": "Angular",
            "rating": 3
        },
        {
            "name": "Javascript",
            "rating": 3
        },
        {
            "name": "CSS",
            "rating": 3
        },
        {
            "name": "Bootstrap",
            "rating": 3
        }
    ]
}
  